{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "512"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}, {"size": "512"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/decoder/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/batchnorm/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/moments_1/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/moments_1/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/mul_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d/MirrorPad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_1/MirrorPad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_2/MirrorPad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_3/MirrorPad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "unknown_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_4/MirrorPad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_5/MirrorPad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_6/MirrorPad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_12", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_7/MirrorPad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_13", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "unknown_14", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_8/MirrorPad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "unknown_15", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "3"}]}}}}}, {"name": "unknown_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/clip_by_value/Minimum/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/clip_by_value/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "512"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/strided_slice_1", "op": "StridedSlice", "input": ["input_1", "StatefulPartitionedCall/decoder/strided_slice_1/stack", "StatefulPartitionedCall/decoder/strided_slice_1/stack_1", "StatefulPartitionedCall/decoder/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/strided_slice", "op": "StridedSlice", "input": ["input_1", "StatefulPartitionedCall/decoder/strided_slice/stack", "StatefulPartitionedCall/decoder/strided_slice/stack_1", "StatefulPartitionedCall/decoder/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/decoder/moments_1/mean", "op": "Mean", "input": ["StatefulPartitionedCall/decoder/strided_slice_1", "StatefulPartitionedCall/decoder/moments_1/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/decoder/strided_slice", "StatefulPartitionedCall/decoder/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/decoder/mul_1/x", "StatefulPartitionedCall/decoder/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/moments_1/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/decoder/strided_slice_1", "StatefulPartitionedCall/decoder/moments_1/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/decoder/strided_slice", "StatefulPartitionedCall/decoder/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/moments_1/variance", "op": "Mean", "input": ["StatefulPartitionedCall/decoder/moments_1/SquaredDifference", "StatefulPartitionedCall/decoder/moments_1/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/decoder/moments/SquaredDifference", "StatefulPartitionedCall/decoder/moments/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/decoder/add", "op": "AddV2", "input": ["StatefulPartitionedCall/decoder/moments_1/variance", "StatefulPartitionedCall/decoder/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batchnorm/add", "op": "AddV2", "input": ["StatefulPartitionedCall/decoder/moments/variance", "StatefulPartitionedCall/decoder/batchnorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/Sqrt", "op": "Sqrt", "input": ["StatefulPartitionedCall/decoder/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/decoder/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batchnorm/mul", "op": "Mul", "input": ["StatefulPartitionedCall/decoder/batchnorm/Rsqrt", "StatefulPartitionedCall/decoder/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batchnorm/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/decoder/moments/mean", "StatefulPartitionedCall/decoder/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/decoder/strided_slice", "StatefulPartitionedCall/decoder/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batchnorm/sub", "op": "Sub", "input": ["StatefulPartitionedCall/decoder/moments_1/mean", "StatefulPartitionedCall/decoder/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/decoder/batchnorm/mul_1", "StatefulPartitionedCall/decoder/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/mul", "op": "Mul", "input": ["StatefulPartitionedCall/decoder/mul/x", "StatefulPartitionedCall/decoder/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/decoder/mul", "StatefulPartitionedCall/decoder/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d/MirrorPad", "op": "MirrorPad", "input": ["StatefulPartitionedCall/decoder/add_1", "StatefulPartitionedCall/decoder/sequential/reflection_padding2d/MirrorPad/paddings"], "attr": {"mode": {"s": "UkVGTEVDVA=="}, "Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/conv2d/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/decoder/sequential/reflection_padding2d/MirrorPad", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/sequential/conv2d/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/sequential/up_sampling2d/Shape", "StatefulPartitionedCall/decoder/sequential/up_sampling2d/strided_slice/stack", "StatefulPartitionedCall/decoder/sequential/up_sampling2d/strided_slice/stack_1", "StatefulPartitionedCall/decoder/sequential/up_sampling2d/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d/mul", "op": "Mul", "input": ["StatefulPartitionedCall/decoder/sequential/up_sampling2d/strided_slice", "StatefulPartitionedCall/decoder/sequential/up_sampling2d/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/decoder/sequential/conv2d/Relu", "StatefulPartitionedCall/decoder/sequential/up_sampling2d/mul"], "attr": {"align_corners": {"b": false}, "T": {"type": "DT_FLOAT"}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_1/MirrorPad", "op": "MirrorPad", "input": ["StatefulPartitionedCall/decoder/sequential/up_sampling2d/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_1/MirrorPad/paddings"], "attr": {"mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/decoder/sequential/reflection_padding2d_1/MirrorPad", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_2/MirrorPad", "op": "MirrorPad", "input": ["StatefulPartitionedCall/decoder/sequential/conv2d_1/Relu", "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_2/MirrorPad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "mode": {"s": "UkVGTEVDVA=="}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/decoder/sequential/reflection_padding2d_2/MirrorPad", "unknown_3", "unknown_4"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_3/MirrorPad", "op": "MirrorPad", "input": ["StatefulPartitionedCall/decoder/sequential/conv2d_2/Relu", "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_3/MirrorPad/paddings"], "attr": {"mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/conv2d_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/decoder/sequential/reflection_padding2d_3/MirrorPad", "unknown_5", "unknown_6"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_4/MirrorPad", "op": "MirrorPad", "input": ["StatefulPartitionedCall/decoder/sequential/conv2d_3/Relu", "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_4/MirrorPad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "mode": {"s": "UkVGTEVDVA=="}}}, {"name": "StatefulPartitionedCall/decoder/sequential/conv2d_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/decoder/sequential/reflection_padding2d_4/MirrorPad", "unknown_7", "unknown_8"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/sequential/conv2d_4/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/Shape", "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/strided_slice/stack", "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/strided_slice/stack_1", "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/strided_slice", "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/decoder/sequential/conv2d_4/Relu", "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_5/MirrorPad", "op": "MirrorPad", "input": ["StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_5/MirrorPad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "mode": {"s": "UkVGTEVDVA=="}}}, {"name": "StatefulPartitionedCall/decoder/sequential/conv2d_5/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/decoder/sequential/reflection_padding2d_5/MirrorPad", "unknown_9", "unknown_10"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_6/MirrorPad", "op": "MirrorPad", "input": ["StatefulPartitionedCall/decoder/sequential/conv2d_5/Relu", "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_6/MirrorPad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "mode": {"s": "UkVGTEVDVA=="}}}, {"name": "StatefulPartitionedCall/decoder/sequential/conv2d_6/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/decoder/sequential/reflection_padding2d_6/MirrorPad", "unknown_11", "unknown_12"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/sequential/conv2d_6/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/Shape", "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/strided_slice/stack", "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/strided_slice/stack_1", "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/strided_slice", "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/decoder/sequential/conv2d_6/Relu", "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_7/MirrorPad", "op": "MirrorPad", "input": ["StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_7/MirrorPad/paddings"], "attr": {"mode": {"s": "UkVGTEVDVA=="}, "Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/conv2d_7/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/decoder/sequential/reflection_padding2d_7/MirrorPad", "unknown_13", "unknown_14"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_8/MirrorPad", "op": "MirrorPad", "input": ["StatefulPartitionedCall/decoder/sequential/conv2d_7/Relu", "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_8/MirrorPad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "mode": {"s": "UkVGTEVDVA=="}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/sequential/conv2d_8/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/decoder/sequential/reflection_padding2d_8/MirrorPad", "unknown_15", "unknown_16"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/decoder/clip_by_value/Minimum", "op": "Minimum", "input": ["StatefulPartitionedCall/decoder/sequential/conv2d_8/BiasAdd", "StatefulPartitionedCall/decoder/clip_by_value/Minimum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/clip_by_value", "op": "Maximum", "input": ["StatefulPartitionedCall/decoder/clip_by_value/Minimum", "StatefulPartitionedCall/decoder/clip_by_value/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/decoder/clip_by_value"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "StatefulPartitionedCall/decoder/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/moments/mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/moments/variance/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/batchnorm/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/moments_1/mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/moments_1/variance/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/mul_1/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d/MirrorPad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "unknown_0", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_1/MirrorPad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_1", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "unknown_2", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_2/MirrorPad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_3", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "unknown_4", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_3/MirrorPad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_5", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "unknown_6", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_4/MirrorPad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_7", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "unknown_8", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_5/MirrorPad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_9", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "unknown_10", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_6/MirrorPad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_11", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "unknown_12", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/sequential/up_sampling2d_2/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_7/MirrorPad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_13", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "unknown_14", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/sequential/reflection_padding2d_8/MirrorPad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_15", "shape": [3, 3, 64, 3], "dtype": "float32"}, {"name": "unknown_16", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/clip_by_value/Minimum/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/clip_by_value/y", "shape": [], "dtype": "float32"}]}]}